Repository: Hamzehlov/Home_Expert
Catalog: Home_Expert/Resources/SharedResource.*.resx
Languages: ar

# Project_Title
source: Home Expert
ar: خبراء المنازل

# Service_Moving
source: Moving
ar: نقل

# Service_Sales
source: Sales
ar: مبيعات

# Service_Installation
source: Installation
ar: تركيب

# Hero_Title
source: Empowering Professional Installation Teams
ar: تمكين فرق التركيب المحترفة

# Hero_Description
source: Join the premier platform for furniture and kitchen installation services. Manage your workforce, track orders, and scale your business with ease.
ar: انضم إلى المنصة الرائدة لخدمات تركيب الأثاث والمطابخ. أدر القوى العاملة لديك، وتتبع الطلبات، ووسع نطاق أعمالك بكل سهولة.

# Hero_Trust_Text
source: Trusted by over 1,000+ installation companies globally.
ar: موثوق به من قبل أكثر من 1,000 شركة تركيب عالمياً.

# Footer_Copyright
source: © 2026 Home Expert
ar: ©2026 خبراء المنازل

# Footer_Privacy
source: Privacy Policy
ar: سياسة الخصوصية

# Footer_Terms
source: Terms of Service
ar: شروط الخدمة

# Form_Title
source: Create an Account
ar: إنشاء حساب جديد

# Form_Subtitle
source: Register your company to start managing services.
ar: سجل شركتك للبدء في إدارة الخدمات.

# Step_Details
source: Details
ar: التفاصيل

# Step_Verification
source: Verification
ar: التحقق

# Label_FullName
source: Last Name
ar: الاسم الأخير

# Label_CompanyName
source: Company Name
ar: اسم الشركة

# Label_Email
source: Email Address
ar: البريد الإلكتروني

# Label_Phone
source: Phone Number
ar: رقم الهاتف

# Label_Password
source: Password
ar: كلمة المرور

# Label_FirstNameAr
source: FULL Name (Arabic)
ar: الاسم كامل (عربي)

# Label_FirstNameEn
source: FULL Name (English)
ar: الاسم كامل (إنجليزي)

# Label_CompanyNameAr
source: Company Name (Arabic)
ar: اسم الشركة (عربي)

# Label_CompanyNameEn
source: Company Name (English)
ar: اسم الشركة (إنجليزي)

# Label_DescriptionAr
source: Company Description (Arabic)
ar: وصف الشركة (عربي)

# Label_DescriptionEn
source: Company Description (English)
ar: وصف الشركة (إنجليزي)

# Label_ShowroomAddressAr
source: Address location (Arabic)
ar: عنوان المعرض (عربي)

# Label_ShowroomAddressEn
source: Address location(English)
ar: عنوان المعرض (إنجليزي)

# Label_ShowroomImage
source: Location Image
ar: صورة الموقع

# Label_CommercialFile
source: Commercial Registration File
ar: الملف التجاري

# Label_WorkLicense
source: Work License
ar: رخصة المهن

# Placeholder_FullName
source: Enter your last name
ar: أدخل اسمك الأخير

# Placeholder_CompanyName
source: Company Name
ar: اسم شركتك هنا

# Placeholder_Email
source: ABC@example.com
ar: example@mail.com

# Placeholder_FirstNameAr
source: e.g. أحمد
ar: مثال: أحمد

# Placeholder_CompanyNameAr
source: Company name in Arabic
ar: اسم الشركة بالعربي

# Placeholder_DescriptionAr
source: Describe your company in Arabic...
ar: أخبرنا عن شركتك وخدماتك بالعربي...

# Placeholder_ShowroomAddressAr
source: Enter address location in Arabic
ar: أدخل عنوان المعرض بالعربي

# Placeholder_ShowroomAddressEn
source: Enter address location in English
ar: Enter showroom address in English

# Terms_Agreement
source: I agree to the <a href="#" class="link-accent">Terms of Service</a> and <a href="#" class="link-accent">Privacy Policy</a>.
ar: أوافق على <a href="#" class="link-accent">شروط الخدمة</a> و <a href="#" class="link-accent">سياسة الخصوصية</a>.

# Button_CreateAccount
source: Create Account
ar: إنشاء حساب

# SignIn_Link
source: Already have an account? <a href="/Registration/Login" class="link-accent">Sign In</a>
ar: لديك حساب بالفعل؟ <a href="/Registration/Login" class="link-accent">تسجيل الدخول</a>

# OTP_Title
source: Verify Your Account
ar: تحقق من حسابك

# OTP_Subtitle
source: We've sent a verification code to your email. Please enter it below.
ar: لقد أرسلنا رمز التحقق إلى بريدك الإلكتروني. الرجاء إدخاله أدناه.

# OTP_ResendIn
source: Resend code in
ar: إعادة إرسال الرمز خلال

# OTP_Resend
source: Didn't receive the code? Resend
ar: لم تستلم الرمز؟ إعادة الإرسال

# Button_Verify
source: Verify & Continue
ar: تحقق ومتابعة

source: Back to Registration
ar: العودة للتسجيل

# OTP_TimerText
source: Code expires in:
ar: ينتهي الكود خلال:

# OTP_VerifyButton
source: Verify Code
ar: تحقق من الكود

# OTP_ResendButton
source: Resend Code
ar: إعادة إرسال الكود

# OTP_BackButton
source: Back to Previous Step
ar: العودة للخطوة السابقة

# Login_Title
source: Welcome Back
ar: تسجيل الدخول

# Login_Subtitle
source: Sign in to continue managing your services.
ar: مرحباً بعودتك! سجل دخولك لمتابعة إدارة خدماتك.

# Login_RememberMe
source: Remember me
ar: تذكرني

# Login_ForgotPassword
source: Forgot Password?
ar: نسيت كلمة المرور؟

# Button_Login
source: Sign In
ar: تسجيل الدخول

# SignUp_Link
source: Don't have an account? <a href="/Registration/Registration" class="link-accent">Sign Up</a>
ar: ليس لديك حساب؟ <a href="/Registration/Registration" class="link-accent">إنشاء حساب</a>

# Login_Or
source: OR
ar: أو

# Login_Google
source: Continue with Google
ar: تسجيل الدخول بواسطة Google

# Login_Microsoft
source: Continue with Microsoft
ar: تسجيل الدخول بواسطة Microsoft

# Message_OTPSent
source: Verification code has been sent to your email
ar: تم إرسال رمز التحقق إلى بريدك الإلكتروني

# Message_EmailExists
source: Email address is already in use
ar: البريد الإلكتروني مستخدم بالفعل

# Message_InvalidData
source: Invalid data
ar: بيانات غير صحيحة

# Message_SessionExpired
source: Session expired, please register again
ar: انتهت صلاحية الجلسة، يرجى إعادة التسجيل

# Message_MaxAttemptsReached
source: You have exhausted all attempts (3/3). Please register again.
ar: لقد استنفذت جميع المحاولات (3/3). يرجى إعادة التسجيل والمحاولة مرة أخرى.

# Message_OTPIncorrect
source: Incorrect verification code. Remaining attempts: {0}
ar: رمز التحقق غير صحيح. المحاولات المتبقية: {0}

# Message_RegistrationSuccess
source: Registration successful
ar: تم التسجيل بنجاح

# Message_UserCreationFailed
source: Failed to create user
ar: فشل إنشاء المستخدم

# Message_OTPResent
source: New verification code sent
ar: تم إرسال رمز تحقق جديد

# Message_ServerError
source: An error occurred while processing the request
ar: حدث خطأ أثناء معالجة الطلب

# Label_ServiceType
source: Service Type
ar: نوع الخدمة

# Placeholder_ServiceType
source: Select service type
ar: اختر نوع الخدمة

# Service_Furniture
source: Furniture Moving
ar: نقل أثاث

# Service_KitchenSales
source: Kitchen Sales
ar: بيع مطابخ

# Service_KitchenInstall
source: Kitchen Installation
ar: تركيب مطابخ

# Label_YearsExperience
source: Years of Experience
ar: سنوات الخبرة

# Placeholder_YearsExperience
source: Example: 5
ar: مثال: 5

# Label_Description
source: Company Description
ar: وصف الشركة

# Placeholder_Description
source: Tell us about your company and services...
ar: أخبرنا عن شركتك وخدماتك...

# Label_Logo
source: Company Logo
ar: شعار الشركة

# Logo_Helper
source: Max: 2MB, Supported formats: JPG, PNG, GIF
ar: الحد الأقصى: 2MB، الصيغ المدعومة: JPG, PNG, GIF

# Password_Helper
source: Password must be at least 6 characters
ar: كلمة المرور يجب أن تكون 6 أحرف على الأقل

# Error_FirstNameRequired
source: First name is required
ar: الاسم الأول مطلوب

# Error_FirstNameLength
source: First name must not exceed 50 characters
ar: الاسم الأول يجب أن لا يتجاوز 50 حرف

# Error_FirstArNameRequired
source: First name in Arabic is required
ar: الاسم الأول بالعربي مطلوب

# Error_FirsEntNameRequired
source: First name in English is required
ar: الاسم الأول بالإنجليزي مطلوب

# Error_LastNameRequired
source: Last name is required
ar: الاسم الأخير مطلوب

# Error_LastNameLength
source: Last name must not exceed 50 characters
ar: الاسم الأخير يجب أن لا يتجاوز 50 حرف

# Error_EmailRequired
source: Email is required
ar: البريد الإلكتروني مطلوب

# Error_EmailInvalid
source: Invalid email address
ar: البريد الإلكتروني غير صحيح

# Error_PasswordRequired
source: Password is required
ar: كلمة المرور مطلوبة

# Error_PasswordLength
source: Password must be between 8 and 100 characters
ar: كلمة المرور يجب أن تكون بين 8 و 100 حرف

# Error_PasswordWeak
source: Password must contain at least one uppercase letter, one lowercase letter, one digit, and one special character (!@#$%)
ar: كلمة المرور يجب أن تحتوي على حرف كبير وحرف صغير ورقم ورمز خاص (!@#$%)

# Error_ConfirmPasswordRequired
source: Password confirmation is required
ar: تأكيد كلمة المرور مطلوب

# Error_PasswordMismatch
source: Password and confirmation password do not match
ar: كلمة المرور وتأكيد كلمة المرور غير متطابقين

# Error_PhoneLength
source: Phone number must not exceed 10 digits
ar: رقم الهاتف يجب أن لا يتجاوز 10 أرقام

# Error_PhoneInvalid
source: Invalid phone number
ar: رقم الهاتف غير صحيح

# Error_CompanyNameRequired
source: Company name is required
ar: اسم الشركة مطلوب

# Error_CompanyNameLength
source: Company name must not exceed 100 characters
ar: اسم الشركة يجب أن لا يتجاوز 100 حرف

# Error_CompanyNameArRequired
source: Company name in Arabic is required
ar: اسم الشركة بالعربي مطلوب

# Error_CompanyNameEnRequired
source: Company name in English is required
ar: اسم الشركة بالإنجليزي مطلوب

# Error_DescriptionLength
source: Description must not exceed 500 characters
ar: الوصف يجب أن لا يتجاوز 500 حرف

# Error_YearsExperienceRange
source: Years of experience must be between 0 and 50
ar: سنوات الخبرة يجب أن تكون بين 0 و 50

# Error_ServiceTypeRequired
source: Service type is required
ar: نوع الخدمة مطلوب

# Error_ShowroomAddressLength
source: address location must not exceed 250 characters
ar: عنوان المعرض يجب أن لا يتجاوز 250 حرف
